app/app/Services/SystemService.php

    public static function getPostage()
    {
        return Product::find(1);
---
select * from `products` where `products`.`id` = 1 and `products`.`deleted_at` is null limit 1