app/app/Models/Subscription.php

        public static function getAddDate()
        {
            $user = auth()->user();
            // 過去に契約がないならnullを返す。
            if ( null === auth()->user()->subscription('default') ) return null;
            // 契約日を返す。
            return self::where('user_id',$user->id)->first()->created_at;
---
select * from `subscriptions` where `user_id` = 1 limit 1

        public static function getCancelDate()
        {
            $user = auth()->user();
            // 過去に契約がないならnullを返す。
            if ( null === $user->subscription('default') ) return null;
            // サブスクを解約済でないならnullを返す。
            if ( !$user->subscription('default')->canceled() ) return null;
            // 解約を送信した日を返す。
            return self::where('user_id',$user->id)->first()->updated_at;
---
select * from `subscriptions` where `user_id` = 1 limit 1

        public static function getLastDate()
        {
            $user = auth()->user();
            // 過去に契約がないならnullを返す。
            if ( null === $user->subscription('default') ) return null;
            // 解約日（最終日）を返す。
            return self::where('user_id', $user->id)->first()->ends_at;
---
select * from `subscriptions` where `user_id` = 1 limit 1