app/app/Http/Controllers/User/CartController.php

    public function index()
    {
        $userId = auth()->id();
        $user = User::with('products.image_1')->findOrfail($userId);
---
select * from `images` where `images`.`id` in (30, 32)
select * from `users` where `users`.`id` = 1 limit 1
select `products`.*, `carts`.`user_id` as `pivot_user_id`, `carts`.`product_id` as `pivot_product_id`, `carts`.`id` as `pivot_id`, `carts`.`quantity` as `pivot_quantity` from `products` inner join `carts` on `products`.`id` = `carts`.`product_id` where `carts`.`user_id` in (1) and `products`.`deleted_at` is null