app/app/Http/Controllers/User/OrderController.php

select * from `images` where `images`.`id` in (1, 40)
select * from `ordered_products` where `ordered_products`.`order_id` in (5, 6, 7, 8, 9, 10)
select * from `orders` where `user_id` = 1 order by `id` desc limit 10 offset 0
select * from `products` where `products`.`id` in (1, 128, 566) and `products`.`deleted_at` is null
---
    public function index()
    {
        $user = auth()->user();
        $orders = Order::with(['ordered_products.product.image_1', 'ordered_products.product.shop'])->where('user_id', $user->id)->orderByDesc('id')->paginate(10);