app/app/Http/Controllers/User/ProductController.php

    public function index()
    {
        $products = Product::with(['image_1', 'secondary_category'])->searchProducts()
            ->where('is_selling', 1)
            ->paginate(15);

        $primaryCategories = PrimaryCategory::orderBy('sort_order')
            ->with(['secondary_categories' => function($q){
                $q->orderBy('sort_order');
            }])->get();
---
select * from `secondary_categories` where `secondary_categories`.`id` in (2, 4, 5, 6, 7, 9)
select count(*) as aggregate from `products` where `is_selling` = 1 and `products`.`deleted_at` is null
select * from `primary_categories` order by `sort_order` asc
select * from `secondary_categories` where `secondary_categories`.`primary_category_id` in (1, 2, 3) order by `sort_order` asc

    public function show(string $id)
    {
        $product = Product::with(['image_1', 'secondary_category', 'stocks', 'shop'])->findOrFail($id);
---
select * from `products` where `products`.`id` = '15' and `products`.`deleted_at` is null limit 1
select * from `secondary_categories` where `secondary_categories`.`id` in (4)
select * from `shops` where `shops`.`id` in (2)
select * from `t_stocks` where `t_stocks`.`product_id` in (15)