app/app/Http/Controllers/User/PurchaseController.php

    public function index()
    {
        $userId = auth()->id();
        $user = User::with('products.image_1')->findOrfail($userId);
---
select * from `images` where `images`.`id` in (32)
select * from `users` where `users`.`id` = 1 limit 1
select `products`.*, `carts`.`user_id` as `pivot_user_id`, `carts`.`product_id` as `pivot_product_id`, `carts`.`id` as `pivot_id`, `carts`.`quantity` as `pivot_quantity` from `products` inner join `carts` on `products`.`id` = `carts`.`product_id` where `carts`.`user_id` in (1) and `products`.`deleted_at` is null

    public function create()
    {
        // まず合計金額を取得。
        $userId = auth()->id();
        $user = User::with('products.image_1')->findOrfail($userId);
---
select * from `images` where `images`.`id` in (30, 32)
select * from `users` where `users`.`id` = 1 limit 1
select `products`.*, `carts`.`user_id` as `pivot_user_id`, `carts`.`product_id` as `pivot_product_id`, `carts`.`id` as `pivot_id`, `carts`.`quantity` as `pivot_quantity` from `products` inner join `carts` on `products`.`id` = `carts`.`product_id` where `carts`.`user_id` in (1) and `products`.`deleted_at` is null

                ],
            );
            // ordersテーブルに購入履歴を追加。
            $order = Order::create([
                'user_id' => $user->id,
                'payment_id' => $payment->id,
            ]);
---
insert into `orders` (`user_id`, `payment_id`, `updated_at`, `created_at`) values (1, 'pi_3OeZn5Aaxxyh99RE3UW1ZnkV', '2024-01-31 09:09:08', '2024-01-31 09:09:08')

                    'updated_at' => Carbon::now(),
                ];
            }
            OrderedProduct::insert($insertRows);
---
insert into `ordered_products` (`created_at`, `order_id`, `price`, `product_id`, `quantity`, `updated_at`) values ('2024-01-31 09:09:08', 12, 45790, 402, 1, '2024-01-31 09:09:08'), ('2024-01-31 09:09:08', 12, 37232, 376, 4, '2024-01-31 09:09:08')